app/controllers/users_controller.rb

  def show
    #@user = User.find(params[:id])
    @user = User.first()
    @vehicle_stats =  VehicleStatus.first()
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "vehicle_statuses".* FROM "vehicle_statuses" ORDER BY "vehicle_statuses"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)

  def show_stats
    @vehicle_stats =  VehicleStatus.first()
---
SELECT  "vehicle_statuses".* FROM "vehicle_statuses" ORDER BY "vehicle_statuses"."id" ASC LIMIT ?  [["LIMIT", 1]]